bayarveli/esp32-zigbee-homeassistant-temperature-humidity-monitor/sdkconfig.defaults
# ESP32-H2 Configuration Defaults
CONFIG_IDF_TARGET="esp32h2"

# Flash configuration for ESP32-H2
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# Partition table - use custom table with Zigbee storage
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS - Increase main task stack size to prevent overflow
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Zigbee Configuration
CONFIG_ZB_ENABLED=y
CONFIG_ZB_RADIO_NATIVE=y
